Revit 2026 API

# FabricationItemFolder Properties

---

The FabricationItemFolder type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Name | The item folder's name. |

#### Reference

FabricationItemFolder Class

Autodesk.Revit.DB Namespace